app/views/articles/show.html.erb

<h4 class = my-3>コメント</h4>
  <% @article.article_comments.each do |article_comment| %>
---
SELECT "articles".* FROM "articles"
SELECT "article_comments".* FROM "article_comments" WHERE "article_comments"."article_id" = ?  [["article_id", 1]]