app/views/homes/index.html.erb

SELECT "categories".* FROM "categories"
---
      <%= form_with url: homes_path, method: :get, local: true do |f| %>
        <%= f.collection_select(:category_id, Category.all, :id, :name) %>