app/controllers/article_comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @article_comment = @article.article_comments.create(article_comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "article_comments" ("name", "comment", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test1"], ["comment", "testtest1"], ["article_id", 1], ["created_at", "2021-05-15 09:22:38.535293"], ["updated_at", "2021-05-15 09:22:38.535293"]]

  def destroy
    @article = Article.find(params[:article_id])
    @article_comment = @article.article_comments.find(params[:id])
    @article_comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "article_comments".* FROM "article_comments" WHERE "article_comments"."article_id" = ? AND "article_comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "article_comments" WHERE "article_comments"."id" = ?  [["id", 1]]