app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "image_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = ?, "image_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "かりんちゃんの成長日記 うううううううううううううううううううう"], ["image_id", "6bf5cb03934af4841b4910ede771b797e8c2c355bf70957943b89c4acd37"], ["updated_at", "2021-05-25 08:08:56.652843"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)