app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "スマートフォン"], ["created_at", "2021-05-15 02:58:51.698175"], ["updated_at", "2021-05-15 02:58:51.698175"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @category = Category.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "パソコン"], ["updated_at", "2021-05-15 03:01:21.429125"], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)