app/controllers/homes_controller.rb

SELECT "articles".* FROM "articles"
---
  def top
    @articles = Article.all

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
SELECT COUNT(*) FROM "articles"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC  [["category_id", 2]]
---
  def index
    @articles = Article.all
    @article_amount = Article.count
    # @categories = Category.all
    # @category = 0
    # urlにcategory_id(params)がある場合
    if params[:category_id]
      # Categoryのデータベースのテーブルから一致するidを取得
      @category = Category.find(params[:category_id])

      # category_idと紐づく投稿を取得
      @articles = @category.articles.order(created_at: :desc).all